{"displayProperties":{"description":"Late one evening, I was shuffling home after a long day of Dawning preparations. It was a popular night for parties, so I was threading my way through the crowds on my weary old feet, enjoying the laughter and flushed faces of those I passed.\n\nA roar of many voices drew my attention to the open window of a large chamber packed with merrymakers. I asked myself, now who could that be, causing all that noise? Ay! Believe it or not, it was the Cryptarchs!\n\nThey were playing some kind of game, someone holding up an engram, people shouting out comical guesses about what was inside—I don't know what Cryptarchs find fun, honestly. But I saw the door open and someone with a hood slip out very quickly and vanish into the crowd. I remember chuckling to myself, that's somebody making an escape, all right!\n\nBy now, many of the festivities were winding down, and the streets overflowed with oh-so-lively residents of our Tower. I could barely set one sore foot in front of the other in the press of people! So it was that I found myself almost shoulder to shoulder with the Cryptarch who'd fled the party. Even though he was pulling his hood down to conceal his face, I recognized him: Master Rahool.\n\nI wasn't the only one to do so.\n\n\"Hey Rahool, get any blues from a purple this Dawning?\" someone yelled, to a chorus of raucous laughs. I didn't understand, but he looked taken aback.\n\nThen, approaching from the opposite direction, some young people with that scruffy, bright-eyed look of students started tapping one another on the shoulder and pointing. They pushed one boy forward, and he stared intently at Rahool, scrunching up his face. The Cryptarch must have sensed the young scholar meant to accost him, because he tried to head the other way in the throng. No luck, of course.\n\n\"Master Rahool, Happy Dawning!\" I heard the youth begin. \"Me and my friends, we're just beginning our studies in cryptography, and we had this theory about Ulan—\"\n\nAt this point, I told myself, Eva, you have to save him.\n\nI made a great push through the masses and hooked my arm into poor Rahool's. \"I need the Cryptarch's help!\" I chirped at the students, with an apologetic shrug. Then I hauled Rahool toward a side street. I may be petite, but after decades of walking through the City, I can move through a crowd when I want to.\n\nWe ducked through alleys and passages until I found an empty courtyard. \"I think we can wait out the crowds here,\" I told the Cryptarch, who gave a curt nod. My feet were throbbing at this point, so I threw myself down on a bench, removed my slippers, and began to rub my aching soles. Rahool stood there staring at his own feet like he was contemplating the infinite universe.\n\nFinally I looked around to get my bearings. \"Oh!\" I exclaimed, pointing. \"Turn around, Cryptarch!\"\n\nRahool followed my gaze. Above our heads, strings of shining globes and jewel-colored lanterns traced bright lines across a sky of deep-blue velvet. Below us stretched the twinkling lights of the City. The soothing curve of the Traveler was just visible.\n\nRahool seated himself beside me, and we settled into an amicable silence, with only the occasional rustle of a Dawning banner whipping in the breeze to break the calm. My feet gradually ceased to ache.\n\nFinally, after minutes or hours, I stood and slipped my shoes on again. \"I must go home and sleep,\" I told him, raising a hand in farewell. \"I think the streets will be empty now.\"\n\nThe Cryptarch's face twitched in what I imagine was an attempt to smile. \"Happy Dawning, Eva Levante.\" he managed.\n\nWhen I departed, he was seated still, hands folded neatly on his lap and a serene face tilted toward the heavens.\n\n---\n\nBurnt Edge Transits:\nMix two ingredients that do not successfully combine, add Essence of Dawning, then bake.","name":"Celebrate in Your Own Way","icon":"/common/destiny2_content/icons/4351e3fe33c75c7f2a0a8003440ab9a5.png","hasIcon":true},"subtitle":"","hash":3073758982,"index":910,"redacted":false,"blacklisted":false}